ib2b-documentation/content/services/managespinventory/samples/getResourceInventory/Normal - Get BEAM Resource Inventory with AVC/00_getResourceInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?><!--
	@operation getResourceInventory
	@action queryResourceInventory
	@sender FLS
	@receiver EPS
	@scenario Query BEAM resource inventory
	@name Normal - Query BEAM Resource Inventory with AVC
	@description This is a sample request message for the scenario: Query BEAM resource inventory with AVC is successful
	@version V1.0
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5"
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>getResourceInventory</activityName>
			<msgName>ManageSPInventorygetResourceInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>Fulfilment</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>
				<SPInventoryComprisedOf>
					<!-- Query to perform. (determines the responseType as described in Fulfilment ICD 2.6 -->
					<action>Beam AVC Query</action>
					<!-- NSAS or NWAS -->
					<ItemInvolvesProduct>
						<type>NSAS</type>
					</ItemInvolvesProduct>
					<!-- Resource Type. Allowed values for NSAS are CSA, BEAM, NTD. Allowed values for NWAS are NTD. -->'
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<ID>123</ID>
							<type>BEAM</type>
						</ItemInvolvesResource>
					</ReferencesSPInventoryItem>
					<!--  Additional Satellite details required for for BEAM queries -->
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<ID>1A</ID>
							<type>SATELLITE</type>
						</ItemInvolvesResource>
					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>